; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob39) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate11)
	(at pallet2 distributor1)
	(clear crate12)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 363)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 396)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 39)
	(at crate1 depot0)
	(on crate1 crate0)
	(= (weight crate1) 60)
	(at crate2 depot0)
	(on crate2 crate1)
	(= (weight crate2) 51)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(= (weight crate3) 93)
	(at crate4 depot0)
	(on crate4 crate2)
	(= (weight crate4) 72)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 43)
	(at crate6 distributor0)
	(on crate6 crate3)
	(= (weight crate6) 79)
	(at crate7 depot0)
	(on crate7 crate5)
	(= (weight crate7) 10)
	(at crate8 distributor0)
	(on crate8 crate6)
	(= (weight crate8) 25)
	(at crate9 distributor1)
	(on crate9 pallet2)
	(= (weight crate9) 96)
	(at crate10 distributor0)
	(on crate10 crate8)
	(= (weight crate10) 41)
	(at crate11 distributor0)
	(on crate11 crate10)
	(= (weight crate11) 25)
	(at crate12 distributor1)
	(on crate12 crate9)
	(= (weight crate12) 34)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 crate11)
		(on crate2 pallet1)
		(on crate4 crate7)
		(on crate5 pallet0)
		(on crate6 pallet2)
		(on crate7 crate9)
		(on crate8 crate12)
		(on crate9 crate8)
		(on crate11 crate6)
		(on crate12 crate0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist0 crate7 crate5 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate5)
   added: (lifting hoist0 crate7) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 11
2. (lift hoist2 crate12 crate9 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist2) (on crate12 crate9)
   added: (lifting hoist2 crate12) (clear crate9)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 11
3. (lift hoist1 crate11 crate10 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 crate10)
   added: (lifting hoist1 crate11) (clear crate10)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 11
4. (drop hoist0 crate7 crate5 depot0)
   deleted: (lifting hoist0 crate7) (clear crate5)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate5)
   goals met: 0 of 11
5. (load hoist2 crate12 truck0 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 34
   goals met: 0 of 11
6. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 11
7. (lift hoist2 crate9 pallet2 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 pallet2)
   added: (lifting hoist2 crate9) (clear pallet2)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 11
8. (load hoist1 crate11 truck1 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 25
   goals met: 0 of 11
9. (lift hoist1 crate10 crate8 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate8)
   added: (lifting hoist1 crate10) (clear crate8)
   changed: (fuel-cost) from 14 to 15
   goals met: 0 of 11
10. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 25 to 66
   goals met: 0 of 11
11. (lift hoist1 crate8 crate6 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate6)
   added: (lifting hoist1 crate8) (clear crate6)
   changed: (fuel-cost) from 15 to 16
   goals met: 0 of 11
12. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 34 to 59
   goals met: 0 of 11
13. (lift hoist0 crate7 crate5 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate5)
   added: (lifting hoist0 crate7) (clear crate5)
   changed: (fuel-cost) from 16 to 17
   goals met: 0 of 11
14. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 17 to 27
   goals met: 0 of 11
15. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 59 to 34
   goals met: 0 of 11
16. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 66 to 76
   goals met: 0 of 11
17. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 27 to 37
   goals met: 0 of 11
18. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 34 to 59
   goals met: 0 of 11
19. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   changed: (fuel-cost) from 37 to 38
   goals met: 0 of 11
20. (lift hoist1 crate6 crate3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate3)
   added: (lifting hoist1 crate6) (clear crate3)
   changed: (fuel-cost) from 38 to 39
   goals met: 0 of 11
21. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 39 to 49
   goals met: 0 of 11
22. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 59 to 138
   goals met: 0 of 11
23. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 76 to 172
   goals met: 0 of 11
24. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   changed: (fuel-cost) from 49 to 50
   goals met: 0 of 11
25. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 138 to 231
   goals met: 0 of 11
26. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck1) from 172 to 131
   goals met: 0 of 11
27. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 50 to 60
   goals met: 0 of 11
28. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 60 to 70
   goals met: 0 of 11
29. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 231 to 274
   goals met: 0 of 11
30. (lift hoist0 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate2)
   added: (lifting hoist0 crate4) (clear crate2)
   changed: (fuel-cost) from 70 to 71
   goals met: 0 of 11
31. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   changed: (current_load truck1) from 131 to 203
   goals met: 0 of 11
32. (lift hoist0 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate1)
   added: (lifting hoist0 crate2) (clear crate1)
   changed: (fuel-cost) from 71 to 72
   goals met: 0 of 11
33. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 203 to 254
   goals met: 0 of 11
34. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate0)
   added: (lifting hoist0 crate1) (clear crate0)
   changed: (fuel-cost) from 72 to 73
   goals met: 0 of 11
35. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 254 to 314
   goals met: 0 of 11
36. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 73 to 74
   goals met: 0 of 11
37. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 74 to 84
   goals met: 0 of 11
38. (load hoist2 crate10 truck1 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   changed: (current_load truck1) from 314 to 355
   goals met: 0 of 11
39. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 84 to 94
   goals met: 0 of 11
40. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   changed: (current_load truck0) from 274 to 313
   goals met: 0 of 11
41. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 313 to 270
   goals met: 0 of 11
42. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 94 to 104
   goals met: 0 of 11
43. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 104 to 114
   goals met: 0 of 11
44. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 270 to 245
   goals met: 0 of 11
45. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   changed: (current_load truck1) from 355 to 380
   goals met: 0 of 11
46. (unload hoist1 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 380 to 284
   goals met: 0 of 11
47. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 245 to 341
   goals met: 0 of 11
48. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 341 to 262
   goals met: 0 of 11
49. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 284 to 363
   goals met: 0 of 11
50. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 363 to 291
   goals met: 0 of 11
51. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 262 to 334
   goals met: 0 of 11
52. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 334 to 241
   goals met: 0 of 11
53. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 291 to 384
   goals met: 0 of 11
54. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck1) from 384 to 359
   goals met: 0 of 11
55. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 241 to 266
   goals met: 0 of 11
56. (unload hoist1 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck1) from 359 to 308
   goals met: 0 of 11
57. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 266 to 317
   goals met: 0 of 11
58. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 308 to 267
   goals met: 0 of 11
59. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 317 to 358
   goals met: 0 of 11
60. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 358 to 307
   goals met: 0 of 11
61. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 1 of 11
62. (unload hoist1 crate7 truck1 distributor0)
   deleted: (in crate7 truck1) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck1) from 267 to 257
   goals met: 1 of 11
63. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 307 to 317
   goals met: 1 of 11
64. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 114 to 124
   goals met: 1 of 11
65. (drop hoist0 crate5 pallet0 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 2 of 11
66. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 257 to 178
   goals met: 2 of 11
67. (drop hoist2 crate6 pallet2 distributor1)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 pallet2)
   goals met: 3 of 11
68. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 317 to 278
   goals met: 3 of 11
69. (drop hoist1 crate0 crate2 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate2)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate2)
   goals met: 4 of 11
70. (unload hoist2 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck1) from 178 to 153
   goals met: 4 of 11
71. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   changed: (current_load truck0) from 278 to 244
   goals met: 4 of 11
72. (drop hoist1 crate12 crate0 distributor0)
   deleted: (lifting hoist1 crate12) (clear crate0)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 crate0)
   goals met: 5 of 11
73. (unload hoist1 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck0) from 244 to 219
   goals met: 5 of 11
74. (drop hoist1 crate8 crate12 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate12)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate12)
   goals met: 6 of 11
75. (drop hoist2 crate11 crate6 distributor1)
   deleted: (lifting hoist2 crate11) (clear crate6)
   added: (available hoist2) (at crate11 distributor1) (clear crate11) (on crate11 crate6)
   goals met: 7 of 11
76. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 219 to 123
   goals met: 7 of 11
77. (drop hoist1 crate9 crate8 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate8)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate8)
   goals met: 8 of 11
78. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 123 to 113
   goals met: 8 of 11
79. (drop hoist1 crate7 crate9 distributor0)
   deleted: (lifting hoist1 crate7) (clear crate9)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 crate9)
   goals met: 9 of 11
80. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 113 to 41
   goals met: 9 of 11
81. (drop hoist1 crate4 crate7 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate7)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate7)
   goals met: 10 of 11
82. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 153 to 93
   goals met: 10 of 11
83. (drop hoist2 crate1 crate11 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate11)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate11)
   goals met: 11 of 11
